Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2025DAK176.atdf
         <register caption="" name="SRCON0J" offset="0x8c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0J0" />
            <bitfield mask="0x00000002" name="SR0J1" />
            <bitfield mask="0x00000004" name="SR0J2" />
            <bitfield mask="0x00000008" name="SR0J3" />
            <bitfield mask="0x00000010" name="SR0J4" />
            <bitfield mask="0x00000020" name="SR0J5" />
            <bitfield mask="0x00000040" name="SR0J6" />
            <bitfield mask="0x00000080" name="SR0J7" />
            <bitfield mask="0x00000100" name="SR0J8" />
            <bitfield mask="0x00000200" name="SR0J9" />
            <bitfield mask="0x00000400" name="SR0J10" />
            <bitfield mask="0x00000800" name="SR0J11" />
            <bitfield mask="0x00001000" name="SR0J12" />
            <bitfield mask="0x00002000" name="SR0J13" />
            <bitfield mask="0x00004000" name="SR0J14" />
            <bitfield mask="0x00008000" name="SR0J15" />
         </register>
         <register caption="" name="SRCON0K" offset="0x9c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR0K0" />
            <bitfield mask="0x00000002" name="SR0K1" />
            <bitfield mask="0x00000004" name="SR0K2" />
            <bitfield mask="0x00000008" name="SR0K3" />
            <bitfield mask="0x00000010" name="SR0K4" />
            <bitfield mask="0x00000020" name="SR0K5" />
            <bitfield mask="0x00000040" name="SR0K6" />
            <bitfield mask="0x00000080" name="SR0K7" />
         </register>
         <register caption="" name="SRCON1A" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1A0" />
            <bitfield mask="0x00000002" name="SR1A1" />
            <bitfield mask="0x00000004" name="SR1A2" />
            <bitfield mask="0x00000008" name="SR1A3" />
            <bitfield mask="0x00000010" name="SR1A4" />
            <bitfield mask="0x00000020" name="SR1A5" />
            <bitfield mask="0x00000040" name="SR1A6" />
            <bitfield mask="0x00000080" name="SR1A7" />
            <bitfield mask="0x00000200" name="SR1A9" />
            <bitfield mask="0x00000400" name="SR1A10" />
            <bitfield mask="0x00004000" name="SR1A14" />
            <bitfield mask="0x00008000" name="SR1A15" />
         </register>
         <register caption="" name="SRCON1B" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1B0" />
            <bitfield mask="0x00000002" name="SR1B1" />
            <bitfield mask="0x00000004" name="SR1B2" />
            <bitfield mask="0x00000008" name="SR1B3" />
            <bitfield mask="0x00000010" name="SR1B4" />
            <bitfield mask="0x00000020" name="SR1B5" />
            <bitfield mask="0x00000040" name="SR1B6" />
            <bitfield mask="0x00000080" name="SR1B7" />
            <bitfield mask="0x00000100" name="SR1B8" />
            <bitfield mask="0x00000200" name="SR1B9" />
            <bitfield mask="0x00000400" name="SR1B10" />
            <bitfield mask="0x00000800" name="SR1B11" />
            <bitfield mask="0x00001000" name="SR1B12" />
            <bitfield mask="0x00002000" name="SR1B13" />
            <bitfield mask="0x00004000" name="SR1B14" />
            <bitfield mask="0x00008000" name="SR1B15" />
         </register>
         <register caption="" name="SRCON1C" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="SR1C1" />
            <bitfield mask="0x00000004" name="SR1C2" />
            <bitfield mask="0x00000008" name="SR1C3" />
            <bitfield mask="0x00000010" name="SR1C4" />
            <bitfield mask="0x00001000" name="SR1C12" />
            <bitfield mask="0x00002000" name="SR1C13" />
            <bitfield mask="0x00004000" name="SR1C14" />
            <bitfield mask="0x00008000" name="SR1C15" />
         </register>
         <register caption="" name="SRCON1D" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1D0" />
            <bitfield mask="0x00000002" name="SR1D1" />
            <bitfield mask="0x00000004" name="SR1D2" />
            <bitfield mask="0x00000008" name="SR1D3" />
            <bitfield mask="0x00000010" name="SR1D4" />
            <bitfield mask="0x00000020" name="SR1D5" />
            <bitfield mask="0x00000040" name="SR1D6" />
            <bitfield mask="0x00000080" name="SR1D7" />
            <bitfield mask="0x00000200" name="SR1D9" />
            <bitfield mask="0x00000400" name="SR1D10" />
            <bitfield mask="0x00000800" name="SR1D11" />
            <bitfield mask="0x00001000" name="SR1D12" />
            <bitfield mask="0x00002000" name="SR1D13" />
            <bitfield mask="0x00004000" name="SR1D14" />
            <bitfield mask="0x00008000" name="SR1D15" />
         </register>
         <register caption="" name="SRCON1E" offset="0x4d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1E0" />
            <bitfield mask="0x00000002" name="SR1E1" />
            <bitfield mask="0x00000004" name="SR1E2" />
            <bitfield mask="0x00000008" name="SR1E3" />
            <bitfield mask="0x00000010" name="SR1E4" />
            <bitfield mask="0x00000020" name="SR1E5" />
            <bitfield mask="0x00000040" name="SR1E6" />
            <bitfield mask="0x00000080" name="SR1E7" />
            <bitfield mask="0x00000100" name="SR1E8" />
            <bitfield mask="0x00000200" name="SR1E9" />
         </register>
         <register caption="" name="SRCON1F" offset="0x5d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1F0" />
            <bitfield mask="0x00000002" name="SR1F1" />
            <bitfield mask="0x00000004" name="SR1F2" />
            <bitfield mask="0x00000008" name="SR1F3" />
            <bitfield mask="0x00000010" name="SR1F4" />
            <bitfield mask="0x00000020" name="SR1F5" />
            <bitfield mask="0x00000100" name="SR1F8" />
            <bitfield mask="0x00001000" name="SR1F12" />
            <bitfield mask="0x00002000" name="SR1F13" />
         </register>
         <register caption="" name="SRCON1G" offset="0x6d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1G0" />
            <bitfield mask="0x00000002" name="SR1G1" />
            <bitfield mask="0x00000040" name="SR1G6" />
            <bitfield mask="0x00000080" name="SR1G7" />
            <bitfield mask="0x00000100" name="SR1G8" />
            <bitfield mask="0x00000200" name="SR1G9" />
            <bitfield mask="0x00001000" name="SR1G12" />
            <bitfield mask="0x00002000" name="SR1G13" />
            <bitfield mask="0x00004000" name="SR1G14" />
            <bitfield mask="0x00008000" name="SR1G15" />
         </register>
