Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2025DAK176.atdf
      <value-group caption="Vbus Error Interrupt Enable bit" name="USBCSR2__VBUSERRIE">
         <value caption="Vbus error interrupt is enabled" name="" value="0x1" />
         <value caption="Vbus error interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Registers Select bits" name="USBCSR3__ENDPOINT">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Endpoint 7" name="" value="0x7" />
         <value caption="Endpoint 6" name="" value="0x6" />
         <value caption="Endpoint 5" name="" value="0x5" />
         <value caption="Endpoint 4" name="" value="0x4" />
         <value caption="Endpoint 3" name="" value="0x3" />
         <value caption="Endpoint 2" name="" value="0x2" />
         <value caption="Endpoint 1" name="" value="0x1" />
         <value caption="Endpoint 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Test_SE0_NAK Test Mode Select bit" name="USBCSR3__NAK">
         <value caption="Enter Test_SE0_NAK test mode. The USB module remains in Hi-Speed mode but responds to any valid IN token with a NAK" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Test_J Test Mode Select bit" name="USBCSR3__TESTJ">
         <value caption="Enters Test_J test mode. The USB module transmits a continuous J on the bus." name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Test_K Test Mode Select bit" name="USBCSR3__TESTK">
         <value caption="Enters Test_K test mode. The USB module transmits a continuous K on the bus." name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Test_Packet Test Mode Select bit" name="USBCSR3__PACKET">
         <value caption="The USB module repetitively transmits on the bus a 53-byte test packet. Test packet must be loaded into the Endpoint 0 FIFO before the test mode is entered." name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Test mode Force Hi-Speed Mode Select bit" name="USBCSR3__FORCEHS">
         <value caption="Forces USB module into Hi-Speed mode. Undefined behavior if FORCEFS = 1." name="" value="0x1" />
         <value caption="If FORCEFS is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Test mode Force Full-Speed Mode Select bit" name="USBCSR3__FORCEFS">
         <value caption="Forces USB module into Full-Speed mode. Undefined behavior if FORCEHS is 1" name="" value="0x1" />
         <value caption="(If FORCEHS is 0): places USB module into Low-Speed mode." name="" value="0x0" />
      </value-group>
      <value-group caption="Test Mode Endpoint 0 FIFO Transfer Force bit" name="USBCSR3__FIFOACC">
         <value caption="Transfers the packet in the Endpoint 0 TX FIFO to the Endpoint 0 RX FIFO" name="" value="0x1" />
         <value caption="No transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Test Mode Force Host Select bit" name="USBCSR3__FORCEHST">
         <value caption="Forces USB module into Host mode" name="" value="0x1" />
         <value caption="Normal operation" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Not Empty status bit" name="USBIENCSR0__FIFONE">
         <value caption="There is at least 1 packet in the TX FIFO" name="" value="0x1" />
         <value caption="TX FIFO is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Underrun status bit" name="USBIENCSR0__ERROR">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Flush control bit" name="USBIENCSR0__FLUSH">
         <value caption="Flush the latest packet from the endpoint TX FIFO. The FIFO pointer is reset" name="" value="0x1" />
         <value caption="Do not flush the FIFO" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL handshake transmission control bit" name="USBIENCSR0__SETUPPKT">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0" />
      </value-group>
      <value-group caption="STALL handshake transmission status bit" name="USBIENCSR0__RXSTALL">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Clear Data Toggle Control bit" name="USBIENCSR0__CLRDT">
         <value caption="Resets the endpoint data toggle to 0" name="" value="0x1" />
         <value caption="Do not clear the data toggle" name="" value="0x0" />
      </value-group>
      <value-group caption="Incomplete TX Status bit" name="USBIENCSR0__NAKTMOUT">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint DMA Request Mode Control bit" name="USBIENCSR0__DMAREQMD">
         <value caption="DMA Request Mode 1" name="" value="0x1" />
         <value caption="DMA Request Mode 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Force Endpoint Data Toggle Control bit" name="USBIENCSR0__FRCDATTG">
         <value caption="Forces the endpoint data toggle to switch and the data packet to be cleared from the FIFO" name="" value="0x1" />
         <value caption="No forced behavior" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint DMA Request Enable bit" name="USBIENCSR0__DMAREQEN">
         <value caption="DMA requests are enabled for this endpoint" name="" value="0x1" />
         <value caption="DMA requests are disabled for this endpoint" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Direction Control bit" name="USBIENCSR0__MODE">
         <value caption="Endpoint is TX" name="" value="0x1" />
         <value caption="Endpoint is RX" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto Set Control bit" name="USBIENCSR0__AUTOSET">
         <value caption="TXPKTRDY will be automatically set when data of the maximum packet size (value in TXMAXP) is loaded into the TX FIFO. If a packet of less than the maximum packet size is loaded" name="" value="0x1" />
         <value caption="TXPKTRDY must be set manually for all packet sizes" name="" value="0x0" />
      </value-group>
      <value-group caption="Isochronous TX Endpoint Enable bit" name="USBIENCSR0__ISO">
         <value caption="Enables the endpoint for Isochronous transfers" name="" value="0x40000000" />
         <value caption="Disables the endpoint for Isochronous transfers and enables it for Bulk or Interrupt transfers." name="" value="0x0" />
      </value-group>
      <value-group caption="Data Packet Reception Status bit" name="USBIENCSR1__RXPKTRDY">
         <value caption="A data packet has been received. An interrupt is generated." name="" value="0x1" />
         <value caption="Written by software to clear this bit when the packet has been unloaded from the RX FIFO." name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Full Status bit" name="USBIENCSR1__FIFOFULL">
         <value caption="No more packets can be loaded into the RX FIFO" name="" value="0x1" />
         <value caption="The RX FIFO has at least one free space" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Overrun Status bit" name="USBIENCSR1__ERROR">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Packet Error Status bit" name="USBIENCSR1__DERRNAKT">
         <value caption="Meaning of bitfield depends on Host / Device mode of operation." name="" value="0x1" />
         <value caption="Meaning of bitfield depends on Host / Device mode of operation" name="" value="0x0" />
      </value-group>
